# Norwegian Organisation Numbers

## Introduction

The function `clean_no_orgnr()` cleans a column containing Norwegian organisation number (Orgnr) strings, and standardizes them in a given format. The function `validate_no_orgnr()` validates either a single Orgnr strings, a column of Orgnr strings or a DataFrame of Orgnr strings, returning `True` if the value is valid, and `False` otherwise.

Orgnr strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "988077917"
* `standard`: Orgnr strings with proper whitespace in the proper places, like "988 077 917"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_no_orgnr()` and `validate_no_orgnr()`.

### An example dataset containing Orgnr strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "orgnr": [
            "988077917",
            "988 077 918",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            orgnr                                           address
0       988077917                                     123 Pine Ave.
1     988 077 918                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_no_orgnr`

By default, `clean_no_orgnr` will clean orgnr strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_no_orgnr
clean_no_orgnr(df, column = "orgnr")

,orgnr,address,orgnr_clean
0,988077917,123 Pine Ave.,988 077 917
1,988 077 918,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_no_orgnr(df, column = "orgnr", output_format="standard")

,orgnr,address,orgnr_clean
0,988077917,123 Pine Ave.,988 077 917
1,988 077 918,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_no_orgnr(df, column = "orgnr", output_format="compact")

,orgnr,address,orgnr_clean
0,988077917,123 Pine Ave.,988077917
1,988 077 918,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned Orgnr strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_no_orgnr(df, column="orgnr", inplace=True)

   orgnr_clean                                           address
0  988 077 917                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_no_orgnr(df, "orgnr", errors="coerce")

,orgnr,address,orgnr_clean
0,988077917,123 Pine Ave.,988 077 917
1,988 077 918,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_no_orgnr(df, "orgnr", errors="ignore")

,orgnr,address,orgnr_clean
0,988077917,123 Pine Ave.,988 077 917
1,988 077 918,main st,988 077 918
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_no_orgnr()`

`validate_no_orgnr()` returns `True` when the input is a valid Orgnr. Otherwise it returns `False`.

The input of `validate_no_orgnr()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_no_orgnr()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_no_orgnr()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_no_orgnr
print(validate_no_orgnr("988077917"))
print(validate_no_orgnr("988 077 918"))
print(validate_no_orgnr("51824753556"))
print(validate_no_orgnr("51 824 753 556"))
print(validate_no_orgnr("hello"))
print(validate_no_orgnr(np.nan))
print(validate_no_orgnr("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_no_orgnr(df["orgnr"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: orgnr, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_no_orgnr(df, column="orgnr")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: orgnr, dtype: bool

### Only DataFrame

In [11]:
validate_no_orgnr(df)

   orgnr  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False